# IsATap Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..IsATap Method
FabricationPart Class See Also
---
Checks if it is any sort of tap.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsATap()
```

Visual Basic
---
```text
Public Function IsATap As Boolean
```

Visual C++
---
```text
public:
bool IsATap()
```

# ### Return Value
True if it is any sort of tap.
# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace